[
  {
    "id": "1",
    "name": "Capybara",
    "content": {
      "highlight": "Related to the guinea pig, this native South American is the largest rodent in the world.",
      "description": " Fully grown, the capybara is on average 4 feet (1.2 meters) long and usually weighs more than 100 pounds (45 kilograms). It's rare to find these obscure animals as pets, but there's one capybara named Caplin Rous who's gained a loyal Internet following. His owner, Melanie Typaldos, who lives in Buda, Texas, has made it her mission to educate people about this very unusual rodent.",
      "carring_for_pet": "Typaldos says capybaras are never fully domesticated, so you must handle one often while it's young to establish a human-rodent relationship. Capybaras need lots of outdoor space and places to swim, since they are semi-aquatic creatures. They eat a steady diet of grass and require fresh drinking water at all times.",
      "is_this_pet_right_for_you": "Capybaras need a lot of attention, plenty of room to roam and some type of swimming pool. They can be territorial and could bite with their large teeth. Typaldos doesn't recommend capybaras for families with young children, because the rodents aren't nearly as tolerant as some other domestic pets, like dogs. Like most of the animals on our countdown, your city or state may have exotic pet legislation that would keep you from owning a capybara, so always check the laws before bringing one home."
    },
    "image_url": "http://r.ddmcdn.com/s_f/o_1/APL/uploads/2014/10/unique-pets0.jpg",
    "image_url_hd": "https://www.nationalgeographic.com/content/dam/science/rights-exempt/TEST/capybara_nationalgeographic_1518115_2.ngsversion.1538507728041.adapt.1900.1.jpg"
  },
  {
    "id": "2",
    "name": "Stick insects",
    "content": {
      "highlight": "The stick insect has been entertaining and educating school-age children in classrooms for years, ",
      "description": "because of its unique appearance and simple care needs. Now, more and more people are keeping stick insects as pets at home, according to science author Sandra Markle. These intriguing insects are usually around 3 to 4 inches (7 to 10 centimeters) long and can live for several years in the right conditions.",
      "carring_for_pet": "Stick insects need tall enclosures, at least double the height of the insect, because they like to hang. They are omnivores and thrive on a diet of bramble, ivy or even lettuce. These insects don't like being alone and need other stick insects for companionship. Their enclosures should be kept at room temperature and cleaned out weekly. Stick insects molt many times before they reach maturity and need enough room to literally climb out of their skin.",
      "is_this_pet_right_for_you": "Stick insects are very low-maintenance and generally make good first pets for children, as long as adults are in charge of cleaning and handling duties. Special care should be taken when handling the insects, as their limbs can break easily. The species' unique appearance and interesting molting process make them a living science project for anyone's home."
    },
    "image_url": "http://r.ddmcdn.com/s_f/o_1/APL/uploads/2014/10/unique-pets1.jpg",
    "image_url_hd": "https://www.thoughtco.com/thmb/hWlC3lOiQZRK9Lej59bT69H3vRc=/2121x1414/filters:fill(auto,1)/GettyImages-581746281-59f28a53685fbe00116418fc.jpg"
  },
  {
    "id": "3",
    "name": "Goat",
    "content": {
      "highlight": "Goats have long been kept as pets; even Abraham Lincoln had a pet goat in the White House during his presidency. ",
      "description": "Although most people don't keep standard dairy goats as pets anymore, pygmy goats are popular as pets, thanks to their compact sizes and friendly dispositions. These grass-eaters are similar to small dogs in size and are generally considered easy to care for.",
      "carring_for_pet": "Pygmy goats aren't as high maintenance as standard goats, but they still require shelters that are at least 8 by 10 feet (2.4 by 3 meters) with 4-foot (1.2 meters) high fencing, suggests the National Pygmy Goat Association (NPGA). They are very sociable and are happier in a herd atmosphere or with other pygmies to befriend. A balanced diet for these creatures includes grass hay, brush and leaves. While most livestock vets will treat pygmy goats, you should locate one before bringing home your unique pet.",
      "is_this_pet_right_for_you": "A pygmy goat might be right for you if you are able to provide a home environment that includes strong structures with plenty of land to roam and healthy grass to nosh. The NPGA says that pygmies will react to their owners' voices, but even with a responsive goat, this pet could prove too challenging for most people."
    },
    "image_url": "http://r.ddmcdn.com/s_f/o_1/APL/uploads/2014/10/unique-pets4.jpg",
    "image_url_hd": "https://timedotcom.files.wordpress.com/2018/05/american-airlines-says-no-emotional-support-goats.jpg"
  },
  {
    "id": "4",
    "name": "Donkey",
    "content": {
      "highlight": "Shrek and Fiona might have accepted a donkey into their family in the popular animated movie, ",
      "description": "'Shrek,' but wasn't that just a fairy tale? Not necessarily. The American Pet Products Association reports that more than 3 million people in the United States own equine animals, including miniature donkeys. According to the National Miniature Donkey Association (NMDA), these animals make good pets because they are affectionate and good with children.",
      "carring_for_pet": "Don't let the name fool you: Mini donkeys aren't tiny. They are about 3 feet tall (1.5 meters) and weigh between 200 and 350 pounds (90 and 158 kilograms) at maturity. Mini donkeys have needs similar to those of full-size donkeys: plenty of hay, grain, fresh water and access to a fenced pasture with dry shelter. They also require regular vaccines and should have their hooves trimmed every two to three months. NMDA explains they need the companionship of other mini donkeys, as they are not solitary animals, so taking on one means taking on at least a pair.",
      "is_this_pet_right_for_you": "Do you have plenty of land for at least two mini donkeys to roam? Are you financially prepared to keep up with the large amount of hay your pets will require? Do your city's laws allow for pet donkeys? These are all questions you'll need to find the answers to before you make such a big investment."
    },
    "image_url": "http://r.ddmcdn.com/s_f/o_1/APL/uploads/2014/10/unique-pets2.jpg",
    "image_url_hd": "https://www.thatsfarming.com/uploads/news/resizeExact_1200_800/9297-7190-donkey-1725230-1920.jpg"
  },
  {
    "id": "5",
    "name": "Pig",
    "content": {
      "highlight": "This pig isn't the 1-ton (2,000-pound) variety you'd find on a farm, but a smaller breed that makes a pretty good pet. ",
      "description": "George Clooney famously cared for a potbellied pig named Max for more than 18 years. These squealers are relatively odor-free and easy to train. Police departments have even used potbellied pigs as drug sniffers, because of their trainability and the fact that they have an amazing sense of smell.",
      "is_this_pet_right_for_you": "Potbellies like a regimented schedule, so exercise and mealtimes should be at the same times every day. According to veterinary experts, they have a tendency to become obese, so it's important to maintain a balanced diet and make sure that they get plenty of exercise. Potbellies can be trained to walk on leashes, so you can walk your pig the same way you would a dog for daily activity.",
      "carring_for_pet": "Potbellies are considered intelligent and affectionate animals, but they might not make great pets for everyone. For one thing, the potbelly likes to be the center of attention, so one pig is enough for any family. According to the Merck Veterinarian Manual, this sense of importance can lead to aggressive behavior after the age of 2. Therefore, this peculiar pet doesn't make a good match for a family with small children. The potbelly also loves to root and can destroy carpet, if yours is an indoor pet. And it's worth stating that this pet isn't good for anyone who takes pride in a perfectly manicured lawn."
    },
    "image_url": "http://r.ddmcdn.com/s_f/o_1/APL/uploads/2014/10/unique-pets5.jpg",
    "image_url_hd": "https://kids.nationalgeographic.com/content/dam/kids/photos/animals/Mammals/H-P/pig-fence.ngsversion.1396530611778.adapt.1900.1.jpg"
  }
]
